KonstantinKolesnik/AquaExpert/Source/DTC/- Library/DTC/DTCBootloader/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

uno.name=Arduino Uno Optiboot

uno.vid.0=0x2341
uno.pid.0=0x0043
uno.vid.1=0x2341
uno.pid.1=0x0001

uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xFF
uno.bootloader.high_fuses=0xDE
uno.bootloader.extended_fuses=0x05
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.bootloader.file=optiboot/optiboot_atmega328.hex

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=AVR_UNO
uno.build.core=arduino
uno.build.variant=standard


## Arduino Pro or Pro Mini (3V3 & 5V, 16 MHz) w/ ATmega328 MYSBootloader
## -------------------------------------------------


proDTCBL.name=ATmega328 16Mhz MYSBootloader

proDTCBL.upload.tool=avrdude
proDTCBL.upload.protocol=arduino
proDTCBL.upload.maximum_size=30720
proDTCBL.upload.maximum_data_size=2048
proDTCBL.upload.speed=115200

proDTCBL.bootloader.tool=avrdude
proDTCBL.bootloader.low_fuses=0xF7
proDTCBL.bootloader.high_fuses=0xDA
proDTCBL.bootloader.extended_fuses=0x06
proDTCBL.bootloader.unlock_bits=0x3F
proDTCBL.bootloader.lock_bits=0x0F
proDTCBL.bootloader.file=DTC/DTCBootloader.hex

proDTCBL.build.mcu=atmega328p
proDTCBL.build.f_cpu=16000000L
proDTCBL.build.board=AVR_UNO
proDTCBL.build.core=arduino
proDTCBL.build.variant=standard





